modules/admin/controllers/CategoryController.php

    public function actionEdit()
    {
        $id = Yii::$app->request->get('id');
        $model = Category::find()->where('id = :id', [':id' => $id])->one();
---
SELECT * FROM `category` WHERE id = '4'

    public function actionDelete()
    {
        $id = Yii::$app->request->get('id');
        $model = Category::find()->where('id = :id', [':id' => $id])->one();
---
SELECT * FROM `category` WHERE id = '5'