models/Article.php

    public function addArticle($data)
    {
        if ($this->load($data) && $this->validate()) {
            $this->createtime = time();
---
INSERT INTO `article` (`title`, `catid`, `status`, `author`, `text`, `createtime`) VALUES ('测试文章2', 7, 1, '小明', '<h1>\r\n	测试文章2\r\n</h1>', 1499415862)