models/Category.php

INSERT INTO `category` (`name`, `parent_id`, `introduction`) VALUES ('ThinkPHP', 1, '')
---
    public function addCategory($data)
    {
        if ($this->load($data) && $this->validate()) {
            if ($this->save(false)) {

SELECT * FROM `category` ORDER BY `id`
---
    public function editCategory($data)
    {
        if ($this->load($data) && $this->validate()) {

SELECT * FROM `category` WHERE parent_id = 5
DELETE FROM `category` WHERE `id`=5
---
    public function deleteCategory()
    {
        //如果该分类下有子类不能删除
        $info = Self::find()->where('parent_id = :id', [':id' => $this->id])->one();
        if ($info) {
            $this->failInfo = '该分类下存在子类，不能删除!';
            return false;
        }
        if ($this->delete()) {

SELECT * FROM `category` ORDER BY `id`
---
    public function getSortCategory()
    {
        return $this->_infiniteClass($this->find()->orderBy('id asc')->asArray()->all());